{
  "cursos": [  
    {
        "curso": "GESTÃO E ANÁLISE ESTRATÉGICA DE DADOS",
        "nucleos": ["Data & Analytics"],
        "complexidade_ti": "baixa",
        "disciplinas": [
          { "disciplina": "ESTATÍSTICA GERAL - TEORIA E APLICAÇÕES", "ementa": "Estatística descritiva. Probabilidade e distribuições de probabilidade. Inferência: estimação pontual e intervalar e testes de hipóteses. Utilização de software para análises estatísticas e análise de casos aplicados à gestão.", "carga_horaria": 24 },
          { "disciplina": "BANCOS DE DADOS RELACIONAIS E LINGUAGEM SQL", "ementa": "Fundamentos de bancos de dados. Modelagem de bancos de dados relacionais (Diagrama ER). Linguagem SQL: Data Manipulation Language (DML) e Data Definition Language (DDL).", "carga_horaria": 24 },
          { "disciplina": "CULTURA DATA-DRIVEN E DATA LITERACY", "ementa": "Cultura Data-Driven. Pilares da alfabetização de dados (Data Literacy). Perfis profissionais e gestão de times de dados. Infraestrutura voltada para a coleta, armazenamento e processamento de dados. Gestão orientada a dados. Estratégias para implantação de uma cultura voltada a dados.", "carga_horaria": 24 },
          { "disciplina": "DATA DISCOVERY E ANALYTICS", "ementa": "Fundamentos da descoberta de dados. Fundamentos e requisitos de aplicações de suporte a decisão. Princípios de projeto, arquitetura e construção de aplicações OLAP. Análise, visualização e comunicação de dados. Ferramentas de Data Discovery e Self-Service Analytics.", "carga_horaria": 24 },
          { "disciplina": "GERENCIAMENTO ÁGIL DE PROJETOS", "ementa": "Fundamentos de gerenciamento de projetos. Corpo de Conhecimento em Gerenciamento de Projetos (PMBoK). Abordagens ágeis de gerenciamento de projetos: Manifesto ágil, Métodos ágeis, Scrum, Kanban. Métricas para times ágeis. Ferramentas de gerenciamento de projetos.", "carga_horaria": 24 },
          { "disciplina": "GESTÃO DA PRODUTIVIDADE E AUTOMAÇÃO DE PROCESSOS", "ementa": "Introdução à gestão da produtividade. Robotic Process Automation (RPA). Técnicas e ferramentas para modelagem de processos. Técnicas de integração entre sistemas. Plataformas de gestão e automação de processos. Projeto prático para automação de processo.", "carga_horaria": 24 },
          { "disciplina": "GOVERNANÇA DE DADOS", "ementa": "Contexto organizacional de dados. Conceitos de Governança de Dados - GD. Framework DMBoK. Políticas, padrões e procedimentos aplicados aos dados. Processo de implantação de GD. Modelos de maturidade de dados. GD aplicada em leis de Proteção (LGPD-GDPR). GD 2.0: Ética nos dados, Agilidade em GD, Gerência de Mudanças. Aplicações dos conceitos de GD.", "carga_horaria": 24 },
          { "disciplina": "HUMANIDADES", "ementa": "O ser humano, o processo de humanização e o conceito de pessoa. Desafios contemporâneos e o lugar da religião e da espiritualidade. Autonomia e heteronomia na sociedade atual. Princípios éticos e ética profissional.", "carga_horaria": 24 },
          { "disciplina": "INTELIGÊNCIA ARTIFICIAL E MACHINE LEARNING", "ementa": "Fundamentos de Inteligência Artificial. Processo de Mineração de Dados. Técnicas de aprendizado supervisionado e não-supervisionado. Modelagem da solução. Aplicação de ferramentas de Aprendizado de Máquina.", "carga_horaria": 24 },
          { "disciplina": "INTELIGÊNCIA E PERFORMANCE CORPORATIVA", "ementa": "Modelagem de Negócios. Planejamento Estratégico. Inteligência Competitiva. Abordagens de Gestão: Balanced Scorecard (BSC), Objectives and Key Results (OKR). Implementação da Estratégia. Monitoramento da Estratégia. Fundamentos de Analytics e Business Intelligence.", "carga_horaria": 24 },
          { "disciplina": "MODELAGEM DE DADOS PARA DATA WAREHOUSE", "ementa": "Modelo Dimensional: fatos, dimensões, medidas. Granularidade. Agregação. Principais tipos de Modelos. Principais operadores OLAP. Introdução ao processo ETL. Data lakes.", "carga_horaria": 24 },
          { "disciplina": "PREPARAÇÃO E INTEGRAÇÃO DE DADOS", "ementa": "Fundamentos da coleta e preparação de dados. Processo de descoberta de conhecimento. Processo ETL. Identificação de requisitos. Fontes e tipos de dados. Aplicação de técnicas e ferramentas para coleta, limpeza, processamento, transformação e entrega de dados.", "carga_horaria": 24 },
          { "disciplina": "PROJETOS INTEGRADOS DE ANALYTICS", "ementa": "Fundamentos de Analytics e Business Intelligence. Ciclo de vida dos projetos de soluções em Analytics. Ambiente de desenvolvimento de projetos. Avaliação e definição de projetos integrados às demais disciplinas. Planejamento dos projetos integrados. Garantia da Qualidade (QA). Implementação de Projetos.", "carga_horaria": 24 },
          { "disciplina": "RECUPERAÇÃO DA INFORMAÇÃO NA WEB E EM REDES SOCIAIS", "ementa": "Ferramentas de análise, monitorização e benchmark. Algoritmos e soluções para problemas de busca e extração de informação da Web. Algoritmos e soluções para a análise de redes sociais online e em sites de conteúdo. Web crawling.", "carga_horaria": 24 },
          { "disciplina": "TRANSFORMAÇÕES DIGITAIS", "ementa": "Era de mudanças e aceleração da transformação. Futuro-presente do trabalho. Contexto e conceito de Transformação Digital. Modelos e estratégias para negócios digitais. Metodologias de Foresight e Forecasting. Estratégias e ferramentas para transformação e inovação nos negócios.", "carga_horaria": 24 },
          { "disciplina": "VISUALIZAÇÃO DE DADOS", "ementa": "Fundamentos de visualização de dados. Uso de cores. Tipos de dados. Técnicas de visualização para dados categóricos, séries temporais, distribuição, correlação, dados multivariados, dados geoespaciais, texto, grafos/redes, dados em alta dimensão. Dashboards. Data Storytelling.", "carga_horaria": 24 }
        ]
    },
    {
        "curso": "ESTATÍSTICA PARA CIÊNCIA DE DADOS",
        "nucleos": ["Data & Analytics"],
        "complexidade_ti": "baixa",
        "disciplinas": [
          { "disciplina": "ADVANCED ANALYTICS", "ementa": "Preparação de dados e Feature engineering. Exploração de modelos preditivos. Análise de texto. Utilização de APIs de modelos externos. AutoML. Cloud Analytics. Implementação de pipeline da solução. Integração com Python. Visualização avançada.", "carga_horaria": 24 },
          { "disciplina": "ANÁLISE DE SOBREVIVÊNCIA", "ementa": "Conceitos básicos e dados de sobrevivência. Métodos Não-Paramétricos para estimação da função de sobrevivência.  Modelos probabilísticos em análise de sobrevivência. Modelos de Regressão Paramétricos. Análise de resíduos. Modelagem via função de risco: modelo de Cox e modelo de taxa acelerada. Testes Acelerados: conceitos básicos, relação estresse-resposta e aplicações.", "carga_horaria": 24 },
          { "disciplina": "ANÁLISE DESCRITIVA E PROBABILIDADE", "ementa": "Tipos de Variáveis. Representação tabular e gráfica. Medidas de posição e dispersão.  Análise Bivariada para variáveis qualitativas e quantitativas. Análise bidimensional. Análise de Correlação. Técnicas de visualização para os diversos tipos de variáveis. Experimento. Espaço Amostral e Eventos. Probabilidade e propriedades. Variáveis aleatórias discretas e principais modelos de distribuição discretas. Variáveis aleatórias contínuas e principais modelos de distribuições contínuas. Principais distribuições de Probabilidade. Teorema do Limite Central. Modelos de Convergência. Desigualdade de Tchebyschev. Lei dos grandes números.", "carga_horaria": 24 },
          { "disciplina": "ANÁLISE MULTIVARIADA", "ementa": "Introdução a estatística multivariada. Álgebra vetorial e matricial. Dados multivariados: vetores de médias, matriz de variância e covariância.  Distribuições multivariadas: Normal, T2. Análise: de variância, de agrupamento, fatorial, discriminante, de correlação canônica, multidimensional, de correspondência. Redução de dimensão.", "carga_horaria": 24 },
          { "disciplina": "CULTURA E PRÁTICAS DATAOPS E MLOPS  (NC)", "ementa": "A cultura DataOps e MLOps. Infraestrutura como Código (IaC). Arquitetura de soluções de Machine Learning. Gestão e ciclo de vida da pipeline.", "carga_horaria": 24 },
          { "disciplina": "DATA DISCOVERY E ANALYTICS (NC)", "ementa": "Fundamentos da descoberta de dados. Fundamentos e requisitos de aplicações de suporte a decisão. Princípios de projeto, arquitetura e construção de aplicações OLAP. Análise, visualização e comunicação de dados. Ferramentas de Data Discovery e Self-Service Analytics.", "carga_horaria": 24 },
          { "disciplina": "FRAMEWORKS PARA DEEP LEARNING", "ementa": "Introdução a Keras e Tensorflow. Anatomia de redes neurais com keras e tensorflow. Classificação com deep learning: classificação binária e classificação multiclasse. Regressão linear com deep learning. Monitoramento do modelo e Inferências em modelos treinados. Introdução ao Pytorch e outros frameworks para deep learning.  AutoML. Projeto e utilização de infraestrutura e serviços de computação em nuvem. Implementação de pipeline da solução.", "carga_horaria": 24 },
          { "disciplina": "GOVERNANÇA DE DADOS (NC)", "ementa": "Contexto organizacional de dados. Conceitos de Governança de Dados – GD. Framework DMBoK. Políticas, padrões e procedimentos aplicados aos dados. Processo de implantação de GD. Modelos de maturidade de dados. GD aplicada em leis de proteção (LGPD-GDPR). GD 2.0: Ética nos dados, Agilidade em GD, Gerência de Mudanças. Aplicações dos conceitos de GD. Estudo de casos.", "carga_horaria": 24 },
          { "disciplina": "HUMANIDADES", "ementa": "O ser humano, o processo de humanização e o conceito de pessoa. Desafios contemporâneos e o lugar da religião e da espiritualidade. Autonomia e heteronomia na sociedade atual. Princípios éticos e ética profissional.", "carga_horaria": 24 },
          { "disciplina": "INFERÊNCIA ESTATÍSTICA", "ementa": "Noções gerais de inferência estatística. Métodos de estimação. Propriedades dos estimadores. Estatísticas suficientes. Teste de hipótese. Métodos estatísticos Não-Paramétricos. Testes para uma amostra. Testes para duas amostras relacionadas e duas independentes. Testes para k amostras relacionadas e k amostras independentes. Medidas de correlação e seus testes de significância. Métodos de Reamostragem.", "carga_horaria": 24 },
          { "disciplina": "MACHINE LEARNING", "ementa": "Processo de aprendizagem de máquina. Tipos de dados. Técnicas e algoritmos de aprendizado supervisionado e não-supervisionado. Combinação de modelos. Métricas e avaliação de modelos. ", "carga_horaria": 24 },
          { "disciplina": "MODELOS DE REGRESSÃO", "ementa": "Regressão Linear Múltipla. Modelo de regressão linear múltipla. Estimação dos parâmetros do modelo. Inferências sobre a regressão linear múltipla. Estudo da adequação do modelo. Problemas da regressão linear múltipla. Variáveis Dummy. Modelos Lineares Generalizados: Família Exponencial de Distribuições. Componente sistemática. Função de ligação. Modelos Lineares Generalizados Especiais. Função desvio. Função Escore. Testes de Hipóteses. Matriz de Informação de Fisher. Análise de diagnóstico.", "carga_horaria": 24 },
          { "disciplina": "PYTHON PARA CIÊNCIA DE DADOS", "ementa": "Tipos de dados. Estruturas de controle: condicional e repetição. Estruturas de dados: listas, tuplas, conjuntos, dicionários, séries e dataframes. Funções. Vetorização e matrizes numéricas. Bibliotecas de manipulação de dados, de visualização de dados e vetorização de matrizes.", "carga_horaria": 24 },
          { "disciplina": "REDES NEURAIS E DEEP LEARNING", "ementa": "Introdução a redes neurais artificiais. Deep Learning. Técnicas, métodos e arquiteturas para redes neurais. Redes convolucionais modernas. Aplicações de redes convolucionais e deep learning.", "carga_horaria": 24 },
          { "disciplina": "SÉRIES TEMPORAIS ", "ementa": "Conceitos básicos e modelos de séries temporais. Estacionariedade. Função de autocorrelacão. Modelos no domínio do tempo e da frequência. Método de decomposição. Modelos de tendência: determinística e estocástica. Método de medias moveis. Alisamento exponencial. Modelagem de séries temporais estacionárias: Modelos Autoregressivos e de Médias Móveis (ARMA). Modelagem de séries temporais não estacionárias: transformações e/ou diferenciação. Modelos Autoregressivos Integrados e de Médias Móveis (ARIMA). Modelos Sazonais Autoregressivos Integrados e de Médias Móveis (SARIMA). Análise de intervenção. Regressão em séries temporais. Regressão Dinâmica.", "carga_horaria": 24 },
          { "disciplina": "TÉCNICAS DE AMOSTRAGEM E REGRESSÃO LINEAR", "ementa": "Noções básicas de distribuição e amostragem. Tipos de amostragem. Dimensionamento da amostra. Estimador Razão e Regressão. Técnicas de amostragem. Amostragem aleatória e viés de Amostra. Viés de seleção. Viés e erros não amostrais de não resposta. Estimação da variância. Distribuição de amostragem. Bootstrap. Intervalos de Confiança. Tipos de distribuição. Distribuição Poisson e Distribuições Relacionadas. Regressão linear simples e múltipla. Regressão com Variáveis Qualitativas. Análise de Resíduos. Diagnóstico em Regressão. Seleção de variáveis e construção de modelos. Validação de Modelos. Transformação de Variáveis.", "carga_horaria": 24 }
        ]
    },

    {
        "curso": "ANALYTICS E BUSINESS INTELLIGENCE",
        "nucleos": ["Data & Analytics"],
        "complexidade_ti": "media",
        "disciplinas": [
          { "disciplina": "CULTURA E PRÁTICAS DATAOPS E MLOPS", "ementa": "A cultura DataOps e MLOps. Infraestrutura como Código (IaC). Arquitetura de soluções de Machine Learning. Gestão e ciclo de vida da pipeline.", "carga_horaria": 24 },
          { "disciplina": "DATA DISCOVERY E ANALYTICS", "ementa": "Fundamentos da descoberta de dados. Fundamentos e requisitos de aplicações de suporte a decisão. Princípios de projeto, arquitetura e construção de aplicações OLAP. Análise, visualização e comunicação de dados. Ferramentas de Data Discovery e Self-Service Analytics.", "carga_horaria": 24 },
          { "disciplina": "ESTATÍSTICA GERAL - TEORIA E APLICAÇÕES (NC)", "ementa": "Estatística descritiva. Probabilidade e distribuições de probabilidade. Inferência: estimação pontual e intervalar e testes de hipóteses. Utilização de software para análises estatísticas e análise de casos aplicados à gestão.", "carga_horaria": 24 },
          { "disciplina": "GERENCIAMENTO ÁGIL DE PROJETOS", "ementa": "Fundamentos de gerenciamento de projetos. Corpo de Conhecimento em Gerenciamento de Projetos (PMBoK). Abordagens ágeis de gerenciamento de projetos: Manifesto ágil, Métodos ágeis, Scrum, Kanban. Métricas para times ágeis. Ferramentas de gerenciamento de projetos.", "carga_horaria": 24 },
          { "disciplina": "GESTÃO DE INDICADORES E RESULTADOS", "ementa": "Processo de tomada de decisão. Fundamentos de indicadores de desempenho: conceitos e classificação. Gestão de resultados. Indicadores corporativos: Indicadores Financeiros, Indicadores de Marketing tradicionais e de Marketing Digital, Indicadores da Gestão de Pessoas, Indicadores de Qualidade, Indicadores da Gestão de risco. Abordagens metodológicas para gestão de indicadores.", "carga_horaria": 24 },
          { "disciplina": "GOVERNANÇA DE DADOS", "ementa": "Contexto organizacional de dados. Conceitos de Governança de Dados - GD. Framework DMBoK. Políticas, padrões e procedimentos aplicados aos dados. Processo de implantação de GD. Modelos de maturidade de dados. GD aplicada em leis de Proteção (LGPD-GDPR). GD 2.0: Ética nos dados, Agilidade em GD, Gerência de Mudanças. Aplicações dos conceitos de GD.", "carga_horaria": 24 },
          { "disciplina": "HUMANIDADES", "ementa": "O ser humano, o processo de humanização e o conceito de pessoa. Desafios contemporâneos e o lugar da religião e da espiritualidade. Autonomia e heteronomia na sociedade atual. Princípios éticos e ética profissional.", "carga_horaria": 24 },
          { "disciplina": "INTEGRAÇÃO E FLUXOS DE DADOS", "ementa": "Conceitos. Identificação de requisitos. ETL e ELT. Estrutura de dados ETL. Projeto e desenvolvimento de aplicação ETL. Plano de Teste. Operação.  Ferramentas de ETL. Parametrização e configuração.", "carga_horaria": 24 },
          { "disciplina": "INTELIGÊNCIA E PERFORMANCE CORPORATIVA", "ementa": "Modelagem de Negócios. Planejamento Estratégico. Inteligência Competitiva. Abordagens de Gestão: Balanced Scorecard (BSC), Objectives and Key Results (OKR). Implementação da Estratégia. Monitoramento da Estratégia. Fundamentos de Analytics e Business Intelligence.", "carga_horaria": 24 },
          { "disciplina": "INTRODUÇÃO À LINGUAGEM PYTHON", "ementa": "Introdução à computação. Tipos de dados. Estruturas de controle: condicional e repetição. Estruturas de dados: listas, tuplas, conjuntos e dicionários. Funções.", "carga_horaria": 24 },
          { "disciplina": "MACHINE LEARNING", "ementa": "Processo de aprendizagem de máquina. Tipos de dados. Técnicas e algoritmos de aprendizado supervisionado e não-supervisionado. Combinação de modelos. Métricas e avaliação de modelos.", "carga_horaria": 24 },
          { "disciplina": "MODELAGEM DE DADOS PARA DATA WAREHOUSE", "ementa": "Modelo Dimensional: fatos, dimensões, medidas. Granularidade. Agregação. Principais tipos de Modelos. Principais operadores OLAP. Introdução ao processo ETL. Data lakes.", "carga_horaria": 24 },
          { "disciplina": "PROGRAMAÇÃO PARA CIÊNCIA DE DADOS", "ementa": "Fundamentos da Linguagem Python. Vetorização. Bibliotecas para manipulação de dados. Bibliotecas para visualização de dados.", "carga_horaria": 24 },
          { "disciplina": "PROJETOS INTEGRADOS DE ANALYTICS", "ementa": "Fundamentos de Analytics e Business Intelligence. Ciclo de vida dos projetos de soluções em Analytics. Ambiente de desenvolvimento de projetos. Avaliação e definição de projetos integrados às demais disciplinas. Planejamento dos projetos integrados. Garantia da Qualidade (QA). Implementação de Projetos.", "carga_horaria": 24 },
          { "disciplina": "RECUPERAÇÃO DA INFORMAÇÃO NA WEB E EM REDES SOCIAIS", "ementa": "Ferramentas de análise, monitorização e benchmark. Algoritmos e soluções para problemas de busca e extração de informação da Web. Algoritmos e soluções para a análise de redes sociais online e em sites de conteúdo. Web crawling.  ", "carga_horaria": 24 },
          { "disciplina": "VISUALIZAÇÃO DE DADOS", "ementa": "Fundamentos de visualização de dados. Uso de cores. Tipos de dados. Técnicas de visualização para dados categóricos, séries temporais, distribuição, correlação, dados multivariados, dados geoespaciais, texto, grafos/redes, dados em alta dimensão. Dashboards. Data Storytelling.", "carga_horaria": 24 }
        ]
    }
  ]
}